bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_timer.c
    BL_WR_WORD(TIMERx + TIMER_TMR2_0_OFFSET + 4 * (TIMER_MAX_MATCH * timerCh + cmpNo), val);
}

/****************************************************************************/ /**
 * @brief  TIMER enable or disable compare value effect immediately after update
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 * @param  enable: Enable or disable
 *
 * @return None
 *
*******************************************************************************/
void TIMER_CompValueEffectImmediately(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, BL_Fun_Type enable)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

    tmpVal = BL_RD_REG(TIMERx, TIMER_TCMR);

    if (timerCh == TIMER_CH0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER2_ALIGN, 1 - enable);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER3_ALIGN, 1 - enable);
    }

    BL_WR_REG(TIMERx, TIMER_TCMR, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TIMER get the specified channel count value
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 *
 * @return TIMER count register value
 *
*******************************************************************************/
uint32_t TIMER_GetCounterValue(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh)
{
    uint32_t tmpVal;
    uint32_t tmpAddr;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

    tmpAddr = TIMERx + TIMER_TCR2_OFFSET + 4 * timerCh;

    tmpVal = BL_RD_WORD(tmpAddr);

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  TIMER reset count value
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 *
 * @return None
 *
*******************************************************************************/
void TIMER_ResetCounterValue(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

    tmpVal = BL_RD_REG(TIMERx, TIMER_TCER);

    if (timerCh == TIMER_CH0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, TIMER_TCR2_CNT_CLR);
        BL_WR_REG(TIMERx, TIMER_TCER, tmpVal);
        tmpVal = BL_CLR_REG_BIT(tmpVal, TIMER_TCR2_CNT_CLR);
        BL_WR_REG(TIMERx, TIMER_TCER, tmpVal);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, TIMER_TCR3_CNT_CLR);
        BL_WR_REG(TIMERx, TIMER_TCER, tmpVal);
        tmpVal = BL_CLR_REG_BIT(tmpVal, TIMER_TCR3_CNT_CLR);
        BL_WR_REG(TIMERx, TIMER_TCER, tmpVal);
    }
}

/****************************************************************************/ /**
 * @brief  TIMER get specified channel and comparator match status
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 * @param  cmpNo: TIMER comparator ID type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type TIMER_GetMatchStatus(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo)
{
    uint32_t tmpVal;
    BL_Sts_Type bitStatus = RESET;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
    CHECK_PARAM(IS_TIMER_COMP_ID_TYPE(cmpNo));

    tmpVal = BL_RD_WORD(TIMERx + TIMER_TSR2_OFFSET + 4 * timerCh);

    switch (cmpNo) {
        case TIMER_COMP_ID_0:
            bitStatus = BL_IS_REG_BIT_SET(tmpVal, TIMER_TSR3_0) ? SET : RESET;
            break;

        case TIMER_COMP_ID_1:
            bitStatus = BL_IS_REG_BIT_SET(tmpVal, TIMER_TSR3_1) ? SET : RESET;
            break;

        case TIMER_COMP_ID_2:
            bitStatus = BL_IS_REG_BIT_SET(tmpVal, TIMER_TSR3_2) ? SET : RESET;
            break;

        default:
            break;
    }

    return bitStatus;
}

/****************************************************************************/ /**
 * @brief  TIMER get specified channel preload value
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 *
 * @return Preload register value
 *
*******************************************************************************/
uint32_t TIMER_GetPreloadValue(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh)
{
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

    return BL_RD_WORD(TIMERx + TIMER_TPLVR2_OFFSET + 4 * timerCh);
}

/****************************************************************************/ /**
 * @brief  TIMER set preload register low 32bits value
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 * @param  val: Preload register low 32bits value
 *
 * @return None
 *
*******************************************************************************/
void TIMER_SetPreloadValue(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, uint32_t val)
{
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

    BL_WR_WORD(TIMERx + TIMER_TPLVR2_OFFSET + 4 * timerCh, val);
}

/****************************************************************************/ /**
 * @brief  TIMER set preload trigger source,COMP0,COMP1,COMP2 or None
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 * @param  plSrc: TIMER preload source type
 *
 * @return None
 *
*******************************************************************************/
void TIMER_SetPreloadTrigSrc(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_PreLoad_Trig_Type plSrc)
{
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
    CHECK_PARAM(IS_TIMER_PRELOAD_TRIG_TYPE(plSrc));

    BL_WR_WORD(TIMERx + TIMER_TPLCR2_OFFSET + 4 * timerCh, plSrc);
}

/****************************************************************************/ /**
 * @brief  TIMER set count mode:preload or free run
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 * @param  countMode: TIMER count mode: TIMER_COUNT_PRELOAD or TIMER_COUNT_FREERUN
 *
 * @return None
 *
*******************************************************************************/
void TIMER_SetCountMode(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_CountMode_Type countMode)
{
    uint32_t tmpval;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
    CHECK_PARAM(IS_TIMER_COUNTMODE_TYPE(countMode));

