bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_timer.c
    tmpval = BL_RD_WORD(TIMERx + TIMER_TCMR_OFFSET);
    tmpval &= (~(1 << (timerCh + 1)));
    tmpval |= (countMode << (timerCh + 1));

    BL_WR_WORD(TIMERx + TIMER_TCMR_OFFSET, tmpval);
}

/****************************************************************************/ /**
 * @brief  TIMER clear interrupt status
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 * @param  cmpNo: TIMER macth comparator ID type
 *
 * @return None
 *
*******************************************************************************/
void TIMER_ClearIntStatus(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo)
{
    uint32_t tmpAddr;
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
    CHECK_PARAM(IS_TIMER_COMP_ID_TYPE(cmpNo));

    tmpAddr = TIMERx + TIMER_TICR2_OFFSET + 4 * timerCh;

    tmpVal = BL_RD_WORD(tmpAddr);
    tmpVal |= (1 << cmpNo);

    BL_WR_WORD(tmpAddr, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TIMER initialization function
 *
 * @param  timerId: Timer ID type
 * @param  timerCfg: TIMER configuration structure pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type TIMER_Init(TIMER_ID_Type timerId, TIMER_CFG_Type *timerCfg)
{
    TIMER_Chan_Type timerCh = timerCfg->timerCh;
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CLKSRC_TYPE(timerCfg->clkSrc));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCfg->timerCh));
    CHECK_PARAM(IS_TIMER_PRELOAD_TRIG_TYPE(timerCfg->plTrigSrc));
    CHECK_PARAM(IS_TIMER_COUNTMODE_TYPE(timerCfg->countMode));

    GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_TIMER);

    /* Configure timer clock source */
    tmpVal = BL_RD_REG(TIMERx, TIMER_TCCR);

    if (timerCh == TIMER_CH0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_CS_2, timerCfg->clkSrc);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_CS_3, timerCfg->clkSrc);
    }

    BL_WR_REG(TIMERx, TIMER_TCCR, tmpVal);

    /* Configure timer clock division */
    tmpVal = BL_RD_REG(TIMERx, TIMER_TCDR);

    if (timerCh == TIMER_CH0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_TCDR2, timerCfg->clockDivision);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_TCDR3, timerCfg->clockDivision);
    }

    BL_WR_REG(TIMERx, TIMER_TCDR, tmpVal);

    /* Configure timer count mode: preload or free run */
    TIMER_SetCountMode(timerId, timerCh, timerCfg->countMode);

    /* Configure timer preload trigger src */
    TIMER_SetPreloadTrigSrc(timerId, timerCh, timerCfg->plTrigSrc);

    if (timerCfg->countMode == TIMER_COUNT_PRELOAD) {
        /* Configure timer preload value */
        TIMER_SetPreloadValue(timerId, timerCh, timerCfg->preLoadVal);

        /* Configure match compare values */
        if (timerCfg->matchVal0 > 1 + timerCfg->preLoadVal) {
            TIMER_SetCompValue(timerId, timerCh, TIMER_COMP_ID_0, timerCfg->matchVal0 - 2);
        } else {
            TIMER_SetCompValue(timerId, timerCh, TIMER_COMP_ID_0, timerCfg->matchVal0);
        }

        if (timerCfg->matchVal1 > 1 + timerCfg->preLoadVal) {
            TIMER_SetCompValue(timerId, timerCh, TIMER_COMP_ID_1, timerCfg->matchVal1 - 2);
        } else {
            TIMER_SetCompValue(timerId, timerCh, TIMER_COMP_ID_1, timerCfg->matchVal1);
        }

        if (timerCfg->matchVal2 > 1 + timerCfg->preLoadVal) {
            TIMER_SetCompValue(timerId, timerCh, TIMER_COMP_ID_2, timerCfg->matchVal2 - 2);
        } else {
            TIMER_SetCompValue(timerId, timerCh, TIMER_COMP_ID_2, timerCfg->matchVal2);
        }
    } else {
        /* Configure match compare values */
        if (timerCfg->matchVal0 > 1) {
            TIMER_SetCompValue(timerId, timerCh, TIMER_COMP_ID_0, timerCfg->matchVal0 - 2);
        } else {
            TIMER_SetCompValue(timerId, timerCh, TIMER_COMP_ID_0, timerCfg->matchVal0);
        }

        if (timerCfg->matchVal1 > 1) {
            TIMER_SetCompValue(timerId, timerCh, TIMER_COMP_ID_1, timerCfg->matchVal1 - 2);
        } else {
            TIMER_SetCompValue(timerId, timerCh, TIMER_COMP_ID_1, timerCfg->matchVal1);
        }

        if (timerCfg->matchVal2 > 1) {
            TIMER_SetCompValue(timerId, timerCh, TIMER_COMP_ID_2, timerCfg->matchVal2 - 2);
        } else {
            TIMER_SetCompValue(timerId, timerCh, TIMER_COMP_ID_2, timerCfg->matchVal2);
        }
    }

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(TIMER_CH0_IRQn, TIMER_CH0_IRQHandler);
    Interrupt_Handler_Register(TIMER_CH1_IRQn, TIMER_CH1_IRQHandler);
#endif

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  TIMER set default value of all registers function
 *
 * @param  timerId: TIMER ID type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type TIMER_DeInit(TIMER_ID_Type timerId)
{
    if (TIMER0_ID == timerId) {
        GLB_AHB_MCU_Software_Reset(GLB_AHB_MCU_SW_TIMER);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  TIMER enable one channel function
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 *
 * @return None
 *
*******************************************************************************/
void TIMER_Enable(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

    tmpVal = BL_RD_REG(TIMERx, TIMER_TCER);
    tmpVal |= (1 << (timerCh + 1));

    BL_WR_REG(TIMERx, TIMER_TCER, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TIMER disable one channel function
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 *
 * @return None
 *
*******************************************************************************/
void TIMER_Disable(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

    tmpVal = BL_RD_REG(TIMERx, TIMER_TCER);
    tmpVal &= (~(1 << (timerCh + 1)));

