bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_timer.c
    BL_WR_REG(TIMERx, TIMER_TCER, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TIMER mask or unmask certain or all interrupt
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 * @param  intType: TIMER interrupt type
 * @param  intMask: TIMER interrupt mask value:MASK:disbale interrupt.UNMASK:enable interrupt
 *
 * @return None
 *
*******************************************************************************/
void TIMER_IntMask(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpAddr;
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
    CHECK_PARAM(IS_TIMER_INT_TYPE(intType));
    CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

    tmpAddr = TIMERx + TIMER_TIER2_OFFSET + 4 * timerCh;
    tmpVal = BL_RD_WORD(tmpAddr);

    switch (intType) {
        case TIMER_INT_COMP_0:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TIER3_0));
            } else {
                /* Disable this interrupt */
                BL_WR_WORD(tmpAddr, BL_CLR_REG_BIT(tmpVal, TIMER_TIER3_0));
            }

            break;

        case TIMER_INT_COMP_1:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TIER3_1));
            } else {
                /* Disable this interrupt */
                BL_WR_WORD(tmpAddr, BL_CLR_REG_BIT(tmpVal, TIMER_TIER3_1));
            }

            break;

        case TIMER_INT_COMP_2:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TIER3_2));
            } else {
                /* Disable this interrupt */
                BL_WR_WORD(tmpAddr, BL_CLR_REG_BIT(tmpVal, TIMER_TIER3_2));
            }

            break;

        case TIMER_INT_ALL:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TIER3_0));
                BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TIER3_1));
                BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TIER3_2));
            } else {
                /* Disable this interrupt */
                BL_WR_WORD(tmpAddr, BL_CLR_REG_BIT(tmpVal, TIMER_TIER3_0));
                BL_WR_WORD(tmpAddr, BL_CLR_REG_BIT(tmpVal, TIMER_TIER3_1));
                BL_WR_WORD(tmpAddr, BL_CLR_REG_BIT(tmpVal, TIMER_TIER3_2));
            }

            break;

        default:
            break;
    }
}

/****************************************************************************/ /**
 * @brief  TIMER set gpio polarity
 *
 * @param  timerId: Timer ID type
 * @param  timerCh: TIMER channel type
 * @param  polarity: TIMER GPIO polarity
 *
 * @return None
 *
*******************************************************************************/
void TIMER_GPIOSetPolarity(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh, TIMER_GPIO_Polarity_Type polarity)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

    tmpVal = BL_RD_REG(TIMERx, TIMER_GPIO);

    if (timerCh == TIMER_CH0) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER2_GPIO_INV, polarity);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER3_GPIO_INV, polarity);
    }

    BL_WR_REG(TIMERx, TIMER_GPIO, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TIMER channel 0 enable or disable measure gpio pulse width function
 *
 * @param  timerId: Timer ID type
 * @param  enable: Enable or disable
 *
 * @return None
 *
*******************************************************************************/
void TIMER_CH0_SetMeasurePulseWidth(TIMER_ID_Type timerId, BL_Fun_Type enable)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));

    tmpVal = BL_RD_REG(TIMERx, TIMER_GPIO);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER2_GPIO_EN, enable);
    BL_WR_REG(TIMERx, TIMER_GPIO, tmpVal);
}

/****************************************************************************/ /**
 * @brief  TIMER channel 0 get gpio pulse width value function
 *
 * @param  timerId: Timer ID type
 *
 * @return Pulse width
 *
*******************************************************************************/
uint32_t TIMER_CH0_GetMeasurePulseWidth(TIMER_ID_Type timerId)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));

    do {
        tmpVal = BL_RD_REG(TIMERx, TIMER_GPIO);
    } while (!BL_IS_REG_BIT_SET(tmpVal, TIMER_GPIO_LAT_OK));

    return (BL_RD_REG(TIMERx, TIMER_GPIO_LAT2) - BL_RD_REG(TIMERx, TIMER_GPIO_LAT1));
}

/****************************************************************************/ /**
 * @brief  TIMER force clock division
 *
 * @param  timerId: Timer ID type
 * @param  timerChan: TIMER channel type
 *
 * @return None
 *
*******************************************************************************/
void TIMER_ForceClockDivision(TIMER_ID_Type timerId, TIMER_Chan_Type timerCh)
{
    uint32_t tmpVal;
    uint32_t TIMERx = timerAddr[timerId];

    /* Check the parameters */
    CHECK_PARAM(IS_TIMER_ID_TYPE(timerId));
    CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerChan));

    /* write 0 after write 1 to force clock division */
    tmpVal = BL_RD_REG(TIMERx, TIMER_TCDR_FORCE);

    if (timerCh == TIMER_CH0) {
        tmpVal = BL_SET_REG_BIT(tmpVal, TIMER_TCDR2_FORCE);
    } else {
        tmpVal = BL_SET_REG_BIT(tmpVal, TIMER_TCDR3_FORCE);
    }

